### OOPs in python
- methods
- attributes
- constructor
- examples (ETL)

### Pandas: SQL like tasks in python

In [1]:
#### Create a class that can
# stores the balance information
# name

class Account():
    def __init__(self,balance,name):
        self.balance = balance
        self.name = name

In [2]:
p1 = Account(balance = 400, name="abc")
p2 = Account(balance = 600, name="def")

In [3]:
p1.balance

400

In [4]:
p2.balance

600

In [5]:
p1.name

'abc'

In [6]:
p2.name

'def'

In [7]:
class Account():
    def __init__(this,balance,name):
        this.balance = balance
        this.name = name

In [8]:
p1 = Account(balance = 400, name="abc")

In [9]:
p1.balance

400

In [10]:
print(dir(p1))

['__class__', '__delattr__', '__dict__', '__dir__', '__doc__', '__eq__', '__format__', '__ge__', '__getattribute__', '__gt__', '__hash__', '__init__', '__init_subclass__', '__le__', '__lt__', '__module__', '__ne__', '__new__', '__reduce__', '__reduce_ex__', '__repr__', '__setattr__', '__sizeof__', '__str__', '__subclasshook__', '__weakref__', 'balance', 'name']

In [11]:
## Add methods: have a method that prints out the balance in the account
class Account():
    def __init__(self,balance,name):
        self.balance = balance
        self.name = name
    def show_balance(self):
        print("The balance is "+str(self.balance))

In [12]:
p1 = Account(balance = 400, name="abc")

In [13]:
p1.show_balance()

The balance is 400

In [14]:
p2 = Account(balance = 700, name="abc")

In [15]:
p2.show_balance()

The balance is 700

In [16]:
print(dir(p2))

['__class__', '__delattr__', '__dict__', '__dir__', '__doc__', '__eq__', '__format__', '__ge__', '__getattribute__', '__gt__', '__hash__', '__init__', '__init_subclass__', '__le__', '__lt__', '__module__', '__ne__', '__new__', '__reduce__', '__reduce_ex__', '__repr__', '__setattr__', '__sizeof__', '__str__', '__subclasshook__', '__weakref__', 'balance', 'name', 'show_balance']

In [17]:
### Extend the class: Impliment a withdraw method: take an amount
## as an input and also update the balance

class Account():
    def __init__(self,balance,name):
        self.balance = balance
        self.name = name
    def show_balance(self):
        print("The balance is "+str(self.balance))
    def withdraw(self,amount):
        if amount>self.balance:
            print("Insufficient funds")
        else:
            self.balance = self.balance-amount
            print("An amount of "+str(amount)+" was withdrawn")

In [18]:
p2 = Account(balance = 700, name="abc")

In [19]:
p2.withdraw(1000)

Insufficient funds

In [20]:
p2.balance

700

In [21]:
p2.withdraw(100)

An amount of 100was withdrawn

In [22]:
p2.show_balance()

The balance is 600

In [23]:
### Impliment a deposit method
class Account():
    def __init__(self,balance,name):
        self.balance = balance
        self.name = name
    def show_balance(self):
        print("The balance is "+str(self.balance))
    def withdraw(self,amount):
        if amount>self.balance:
            print("Insufficient funds")
        else:
            self.balance = self.balance-amount
            print("An amount of "+str(amount)+" was withdrawn")
    def deposit(self,amount):
        self.balance = self.balance+amount
        print(f"An amount of {amount} was deposited")

In [24]:
p2 = Account(balance = 700, name="abc")

In [25]:
p2.balance

700

In [26]:
p2.deposit(150)

An amount of 150 was deposited

In [27]:
p2.show_balance()

The balance is 850

In [28]:
## Extend this class to add transaction history
class Account():
    def __init__(self,balance,name):
        self.balance = balance
        self.name = name
        self.transaction_hist = []
    def show_balance(self):
        print("The balance is "+str(self.balance))
    def withdraw(self,amount):
        if amount>self.balance:
            print("Insufficient funds")
        else:
            self.transaction_hist.append({'withdrawl':amount})
            self.balance = self.balance-amount
            print("An amount of "+str(amount)+" was withdrawn")
    def deposit(self,amount):
        self.balance = self.balance+amount
        self.transaction_hist.append({'deposit':amount})
        print(f"An amount of {amount} was deposited")

In [29]:
p2 = Account(balance = 700, name="abc")

In [30]:
p2.transaction_hist

[]

In [31]:
p2.deposit(20)

An amount of 20 was deposited

In [32]:
p2.transaction_hist

[{'deposit': 20}]

In [33]:
p2.withdraw(10)

An amount of 10 was withdrawn

In [34]:
p2.transaction_hist

[{'deposit': 20}, {'withdrawl': 10}]

### Create a class-> Reader

- Method to read a flat file with any delimiter, method should return data
- Method to read a json file, method should return data

In [40]:
### extend the class: how many rows and columns are there in a delimited file
## names of the columns
## if the file is json: store the keys
import csv
import json

class Reader():
    def __init__(self,path):
        self.path = path
        
    def read_csv(self,delimiter):
        data = []
        with open(self.path,"r") as con:
            reader = csv.DictReader(con,delimiter=delimiter)
            for row in reader:
                data.append(row)
        return data
    def read_json(self):
        with open(self.path,'r',encoding='utf-8') as con:
            raw_string = con.read()
        json_data = json.loads(raw_string)
        return json_data

In [36]:
path = "/Users/gunnvantsaini/Library/CloudStorage/OneDrive-Personal/Work/Vired/Content/corp_trainings/tiger_analytics/data/tweets_assignment.txt"

In [37]:
r = Reader(path)

In [39]:
d = r.read_csv(delimiter="|")

In [41]:
path = "/Users/gunnvantsaini/Library/CloudStorage/OneDrive-Personal/Work/Vired/Content/corp_trainings/tiger_analytics/data/sample_json.json"

In [42]:
r = Reader(path)

In [45]:
d = r.read_json()

In [46]:
import csv
import json

class Reader():
    def __init__(self,path):
        self.path = path
        self.rows = None
        self.num_cols = None
        self.cols = None
        
    def read_csv(self,delimiter):
        data = []
        with open(self.path,"r") as con:
            reader = csv.DictReader(con,delimiter=delimiter)
            for row in reader:
                data.append(row)
        self.cols = row.keys()
        self.num_cols = len(row.keys())
        self.rows = len(data)
        return data
    def read_json(self):
        with open(self.path,'r',encoding='utf-8') as con:
            raw_string = con.read()
        json_data = json.loads(raw_string)
        self.cols = json_data.keys()
        return json_data

In [47]:
path = "/Users/gunnvantsaini/Library/CloudStorage/OneDrive-Personal/Work/Vired/Content/corp_trainings/tiger_analytics/data/tweets_assignment.txt"
r = Reader(path)

In [49]:
d = r.read_csv(delimiter="|")

In [50]:
r.cols

dict_keys(['Tweet_Date', 'Tweet_Text', 'Tweet_Handle'])

In [51]:
r.num_cols

3

In [52]:
r.rows

14273

In [53]:
path = "/Users/gunnvantsaini/Library/CloudStorage/OneDrive-Personal/Work/Vired/Content/corp_trainings/tiger_analytics/data/sample_json.json"
r = Reader(path)
d = r.read_json()

In [54]:
r.cols

dict_keys(['type', 'metadata', 'features', 'bbox'])

In [55]:
path = "/Users/gunnvantsaini/Library/CloudStorage/OneDrive-Personal/Work/Vired/Content/corp_trainings/tiger_analytics/data/sample_json.json"
with open(path,'r',encoding='utf-8') as con:
            raw_string = con.read()

In [56]:
json_data = json.loads(raw_string)

In [57]:
type(json_data)

dict

In [58]:
json_data.keys()

dict_keys(['type', 'metadata', 'features', 'bbox'])

In [59]:
d = {'a':1,"v":0}

In [60]:
d.keys()

dict_keys(['a', 'v'])

In [63]:
path = "/Users/gunnvantsaini/Library/CloudStorage/OneDrive-Personal/Work/Vired/Content/corp_trainings/tiger_analytics/data/tweets_assignment.txt"
counter = 0
with open(path,"r") as con:
            reader = csv.DictReader(con,delimiter="|")
            for row in reader:
                counter = counter+1
                print(row)
                print("....")
                print(type(row))
                print("....")
                print(row.keys())
                if counter==5:
                    break

{'Tweet_Date': 'Thu Dec 26 123415 0000 2013', 'Tweet_Text': 'ashdubey ratigirl FirstpostBiz First economic move by AamAadmiParty  How come it has gone down in Guj', 'Tweet_Handle': 'maverickenator'}
....
<class 'dict'>
....
dict_keys(['Tweet_Date', 'Tweet_Text', 'Tweet_Handle'])
{'Tweet_Date': 'Thu Dec 26 123413 0000 2013', 'Tweet_Text': 'RT anandpassion Growing popularity can seen as AAP websites Rank 275 in India highest ever for a political party JoinAAP ankitlal Aam', 'Tweet_Handle': 'aapkask'}
....
<class 'dict'>
....
dict_keys(['Tweet_Date', 'Tweet_Text', 'Tweet_Handle'])
{'Tweet_Date': 'Thu Dec 26 123402 0000 2013', 'Tweet_Text': 'RT anandpassion Growing popularity can seen as AAP websites Rank 275 in India highest ever for a political party JoinAAP ankitlal Aam', 'Tweet_Handle': 'arpshalder'}
....
<class 'dict'>
....
dict_keys(['Tweet_Date', 'Tweet_Text', 'Tweet_Handle'])
{'Tweet_Date': 'Thu Dec 26 123354 0000 2013', 'Tweet_Text': 'ArvindKejriwal AapYogendra AamAadmiParty I hope your party realizes why the likes of alkalamba are trying to join AAP now Be careful', 'Tweet_Handle': 'GargaC'}
....
<class 'dict'>
....
dict_keys(['Tweet_Date', 'Tweet_Text', 'Tweet_Handle'])
{'Tweet_Date': 'Thu Dec 26 123351 0000 2013', 'Tweet_Text': 'RT ssttuuttii Press Conference AamAadmiParty Application form for candidature for LS2014 is being uploaded at website AAP4India http', 'Tweet_Handle': 'kejriwalfanclub'}
....
<class 'dict'>
....
dict_keys(['Tweet_Date', 'Tweet_Text', 'Tweet_Handle'])

### SQL like tasks in python

- Read data from various sources inside pandas (dataframe)
- Data Analysis:
    - groupby+aggregations
    - sort
    - joins
    - filter data/columns

In [64]:
import pandas as pd

In [65]:
path = "/Users/gunnvantsaini/Library/CloudStorage/OneDrive-Personal/Work/Vired/Content/corp_trainings/tiger_analytics/data/athlete_events.csv"
data = pd.read_csv(path)

In [68]:
## select * from table limit 2;
data.head(2) ## dataframe -> SQL Table

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN

In [69]:
data.columns

Index(['ID', 'Name', 'Sex', 'Age', 'Height', 'Weight', 'Team', 'NOC', 'Games',
       'Year', 'Season', 'City', 'Sport', 'Event', 'Medal'],
      dtype='object')

In [72]:
## select name from data 
data[['Name','Age','Event']]

,Name,Age,Event
0,A Dijiang,24.0,Basketball Men's Basketball
1,A Lamusi,23.0,Judo Men's Extra-Lightweight
2,Gunnar Nielsen Aaby,24.0,Football Men's Football
3,Edgar Lindenau Aabye,34.0,Tug-Of-War Men's Tug-Of-War
4,Christine Jacoba Aaftink,21.0,Speed Skating Women's 500 metres
...,...,...,...
271111,Andrzej ya,29.0,Luge Mixed (Men)'s Doubles
271112,Piotr ya,27.0,"Ski Jumping Men's Large Hill, Individual"
271113,Piotr ya,27.0,"Ski Jumping Men's Large Hill, Team"
271114,Tomasz Ireneusz ya,30.0,Bobsleigh Men's Four
271115,Tomasz Ireneusz ya,34.0,Bobsleigh Men's Four

In [74]:
### Write a query which selects the following columns:
# Name
# Event
# Medal
## Show just the first 60 rows
data[["Name","Event","Medal"]].head(5)

                       Name                             Event Medal
0                 A Dijiang       Basketball Men's Basketball   NaN
1                  A Lamusi      Judo Men's Extra-Lightweight   NaN
2       Gunnar Nielsen Aaby           Football Men's Football   NaN
3      Edgar Lindenau Aabye       Tug-Of-War Men's Tug-Of-War  Gold
4  Christine Jacoba Aaftink  Speed Skating Women's 500 metres   NaN

In [75]:
data.head(5)

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [77]:
## find only those rows where the value in the games column is 1992 Summer
## table[logical condition]
data[data["Games"]=="1992 Summer"].head(2)

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
96,33,Mika Lauri Aarnikka,M,24.0,187.0,76.0,Finland,FIN,1992 Summer,1992,Summer,Barcelona,Sailing,Sailing Men's Two Person Dinghy,NaN

In [79]:
### Find out the subset of data where the team was from china?
data[data["Team"]=="China"].head(2)

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN

In [81]:
## table[(cond1)op(cond2)op...(condn)]
data[(data["Games"]=="1992 Summer")&(data["Team"]=="China")].head(2)

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
12569,6848,Bai Chongguang,M,21.0,184.0,83.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Boxing,Boxing Men's Light-Heavyweight,NaN

In [84]:
data.query("Team=='China'").head(2)

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN

In [86]:
data.query("Games=='1992 Summer' and Team == 'China'").head(2)

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
12569,6848,Bai Chongguang,M,21.0,184.0,83.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Boxing,Boxing Men's Light-Heavyweight,NaN

In [88]:
### Rows where age is <26 years and Year = 1992 (use both the methods)
## Method 1
data[(data['Age']<26)&(data['Year']==1992)].head(2)

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
6,5,Christine Jacoba Aaftink,F,25.0,185.0,82.0,Netherlands,NED,1992 Winter,1992,Winter,Albertville,Speed Skating,Speed Skating Women's 500 metres,NaN

In [90]:
## Method 2
data.query("Age<26 and Year==1992").head(2)

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
6,5,Christine Jacoba Aaftink,F,25.0,185.0,82.0,Netherlands,NED,1992 Winter,1992,Winter,Albertville,Speed Skating,Speed Skating Women's 500 metres,NaN

In [96]:
data.query("Age<26 and Year==1992").shape[0]

10633

In [103]:
data.shape[0]

271116

### Sorting

In [102]:
data.head(2)

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN

In [105]:
### Find out the names of top 10 oldest people/.
data.sort_values(by="Age", ascending=False)[['Name','Age']].drop_duplicates().head(10)

                                  Name   Age
257054          John Quincy Adams Ward  97.0
98118                    Winslow Homer  96.0
60863       Thomas Cowperthwait Eakins  88.0
9371             George Denholm Armour  84.0
236912                    Louis Tauzin  81.0
154855            Robert Tait McKenzie  81.0
138812                  Max Liebermann  80.0
170994           Charles Henry Niehaus  77.0
56599                     Albin Dbrich  76.0
170798  William Newzam Prior Nicholson  76.0

**Class Excercise:**

Read the data called `starbucks_final.csv` An ideal diet should contain optimum level of nutrients can you find out the names of the items on menu that contain:

- Upto 450 calories

- Upto 40 g protein

- Upto 10 g fat

- Upto 40 g Carbs

- Upto 5 g fibre

In [106]:
path = "/Users/gunnvantsaini/Library/CloudStorage/OneDrive-Personal/Work/Vired/Content/corp_trainings/tiger_analytics/data/starbucks.csv"
star = pd.read_csv(path)
star.head()

               Name  Calories   Fat  Carb  Fiber  Protein
0      Chonga Bagel       300   5.0    50      3       12
1      8-Grain Roll       380   6.0    70      7       10
2  Almond Croissant       410  22.0    45      3       10
3     Apple Fritter       460  23.0    56      2        7
4  Banana Nut Bread       420  22.0    52      2        6

In [107]:
f = "Calories<450 and Protein<=40 and Fat<=10 and Carb<=40 and Fiber<=5"
star.query(f)['Name']

10                                Chewy Chocolate Cookie
25          Everybody's Favorite - Bantam Bagel (2 Pack)
27                             Frappuccino® Cookie Straw
28                 French Toast - Bantam Bagels (2 Pack)
39                             Petite Vanilla Bean Scone
48                                   Strawberry Cake Pop
49                  The Classic - Bantam Bagels (2 Pack)
77                                     Birthday Cake Pop
78                                    Chocolate Cake Pop
79                  Chocolate Chip Cookie Dough Cake Pop
80                                       Pirate Cake Pop
83                           Classic Whole-Grain Oatmeal
87     Reduced-Fat Turkey Bacon & Cage Free Egg White...
92           Sous Vide Egg Bites: Egg White & Red Pepper
106                                    Berry Trio Yogurt
111                             Organic Avocado (Spread)
Name: Name, dtype: object

In [108]:
## read stores data
path = "/Users/gunnvantsaini/Library/CloudStorage/OneDrive-Personal/Work/Vired/Content/corp_trainings/tiger_analytics/data/stores.csv"
store = pd.read_csv(path)

In [109]:
store.head(2)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2013-152156,11-09-2013,11-12-2013,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.96,2,0.0,41.9136
1,2,CA-2013-152156,11-09-2013,11-12-2013,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.94,3,0.0,219.5820

In [114]:
## groupby
## Undertand the average profit by each city
store.groupby('City').agg({'Profit':['mean','sum'],'Sales':'max'})

                 Profit                Sales
                   mean        sum       max
City
Aberdeen       6.630000     6.6300    25.500
Abilene       -3.758400    -3.7584     1.392
Akron         -8.887410  -186.6356   665.408
Albuquerque   45.292007   634.0881   595.000
Alexandria    19.913644   318.6183  4164.050
...                 ...        ...       ...
Woonsocket    19.669775    78.6791    52.960
Yonkers      184.517047  2767.7557  4899.930
York         -20.433840  -102.1692   422.058
Yucaipa       13.208000    13.2080    50.800
Yuma        -116.497725  -465.9909   599.985

[531 rows x 3 columns]

In [115]:
## find out the avg profit by region and city
store.groupby(['Region','City']).agg({'Profit':'mean'})

                         Profit
Region  City
Central Aberdeen       6.630000
        Abilene       -3.758400
        Allen         -9.969375
        Amarillo     -38.796830
        Ann Arbor     45.783160
...                         ...
West    Westminster   44.922859
        Whittier      44.476800
        Woodland      11.128267
        Yucaipa       13.208000
        Yuma        -116.497725

[583 rows x 1 columns]

### Consider the data set audit.csv, it has characteristics of 2000 tax returns, the data set includes the following variables:

- ID: Unique Identifier for each person
- Age: Age of person
- Employment: Type of Employment
- Education: Highest level of education
- Marital: Current Marital Status
- Occupation: Type of occupation
- Income: Amount of Income declared
- Gender: Gender of Person
- Deductions: Total amount of expenses that a person claims in their financial statements
- Hours: Average hours worked on a weekly basis
- RISK_Adjustment: The continuous target variable; this variable records the monetary amount of any adjustment to the person’s financial claims as a result of a productive audit. This variable is a measure of the size of the risk associated with the person.
- TARGET_Adjusted: The binary target variable for classification modeling (0/1), indicating nonproductive and productive audits, respectively. Productive audits are those that result in an adjustment being made to a client’s financial statement.

**Q1. Compute the %age of productive audits across**

(a) Gender (b) Marital Status (c) Education level

In [116]:
url = "https://raw.githubusercontent.com/Gunnvant/PythonForModellers/master/Data/audit.csv"
audit = pd.read_csv(url)
audit.head(2)

,ID,Age,Employment,Education,Marital,Occupation,Income,Gender,Deductions,Hours,RISK_Adjustment,TARGET_Adjusted
0,1004641,38,Private,College,Unmarried,Service,81838.0,Female,0.0,72,0,0
1,1010229,35,Private,Associate,Absent,Transport,72099.0,Male,0.0,30,0,0

In [117]:
audit['TARGET_Adjusted']

0       0
1       0
2       0
3       1
4       1
       ..
1995    0
1996    0
1997    0
1998    0
1999    0
Name: TARGET_Adjusted, Length: 2000, dtype: int64

In [118]:
sum([0,1,0,1,0,1,1])

4

In [119]:
### average=sum/count, 
### percentage = (achieved/total)
### sum[0,1,0,0,1,1] = #Productive Audits
### Percentage =  #Productive Audits/Total = sum()/Total=average
audit.groupby('Gender').agg({'TARGET_Adjusted':'mean'})

        TARGET_Adjusted
Gender
Female         0.107595
Male           0.288743

In [120]:
audit.groupby('Marital').agg({'TARGET_Adjusted':'mean'})

                       TARGET_Adjusted
Marital
Absent                        0.044843
Divorced                      0.075188
Married                       0.438386
Married-spouse-absent         0.090909
Unmarried                     0.074627
Widowed                       0.067797

In [121]:
audit.groupby('Education').agg({'TARGET_Adjusted':'mean'})

              TARGET_Adjusted
Education
Associate            0.304348
Bachelor             0.423188
College              0.178733
Doctorate            0.629630
HSgrad               0.151515
Master               0.558824
Preschool            0.000000
Professional         0.708333
Vocational           0.174419
Yr10                 0.068966
Yr11                 0.040541
Yr12                 0.058824
Yr1t4                0.000000
Yr5t6                0.086957
Yr7t8                0.000000
Yr9                  0.037037

Use the dataset stored [here](https://drive.google.com/file/d/1WShGELaUTe_NsMvLfDl10OVQJgNgkFwg/view?usp=sharing)

Once you download the data you will end up with a zip file. You will need to unzip it and you will find that there are several csv files. These files contain the data on pollution level collected by IOT sensors. You will observe that many files have same latitude and longitude data. Your task is the following:

1. Find out how many total csv files are there?
2. Club all the files that belong to each location together. One simple way to do this is to generate a dictionary that has lat-longs as keys and files with same location as values.
3. Find out which location has the maximum number of files clubbed together.

In [5]:
import os
import csv

In [2]:
path = "/Users/gunnvantsaini/Downloads/pollution"
file_names = os.listdir(path)

In [3]:
len(file_names)

449

- Create an empty dict
- Loop and read each file
- Read the lat-long record in row1
- Make lat-long as a key in the dict if lat-long is not present with an empty list as value, append the file name to the list
- In case-long is present, append the name of the file in the list

In [14]:
mapping = {}
base_path = "/Users/gunnvantsaini/Downloads/pollution/"
for file_name in file_names:
    path = base_path+file_name
    with open(path, "r") as con:
        reader = csv.DictReader(con,delimiter=",")
        for row in reader:
            long_lat = row['longitude']+"_"+row['latitude']
            break
        if long_lat not in mapping:
            mapping[long_lat]=[]
            mapping[long_lat].append(file_name)
        else:
            mapping[long_lat].append(file_name)

In [16]:
mapping

{'10.182944170639075_56.1589844936963': ['pollutionData188013.csv',
  'pollutionData188066.csv',
  'pollutionData181006.csv'],
 '10.267762215938546_56.22020076302727': ['pollutionData190853.csv',
  'pollutionData190825.csv',
  'pollutionData209907.csv'],
 '10.179336344162948_56.138322977998705': ['pollutionData190338.csv',
  'pollutionData184703.csv',
  'pollutionData190232.csv'],
 '10.189980711639464_56.13458495857738': ['pollutionData209748.csv',
  'pollutionData209721.csv'],
 '10.192906038028696_56.141835968071454': ['pollutionData209774.csv',
  'pollutionData206051.csv',
  'pollutionData206104.csv'],
 '10.179150601188667_56.13844851575673': ['pollutionData209827.csv',
  'pollutionData184675.csv',
  'pollutionData203795.csv'],
 '10.149547918402732_56.170886798880105': ['pollutionData195446.csv',
  'pollutionData195499.csv'],
 '10.176133542327875_56.15591411050229': ['pollutionData188198.csv',
  'pollutionData183117.csv',
  'pollutionData188145.csv'],
 '10.173161614749915_56.210756242190286': ['pollutionData158805.csv'],
 '10.158060728836062_56.14774074192765': ['pollutionData187297.csv',
  'pollutionData184758.csv',
  'pollutionData187244.csv'],
 '10.19604842460626_56.184659561973874': ['pollutionData210146.csv',
  'pollutionData192653.csv'],
 '10.212341355819717_56.187071255964284': ['pollutionData179148.csv'],
 '10.200790644180302_56.18324423193787': ['pollutionData179174.csv'],
 '10.182841611114554_56.15499691392427': ['pollutionData188172.csv',
  'pollutionData181060.csv'],
 '10.141663381614649_56.124304277059785': ['pollutionData197734.csv',
  'pollutionData201749.csv',
  'pollutionData201802.csv'],
 '10.183499758266407_56.149807565419565': ['pollutionData181142.csv'],
 '10.215389695770227_56.161597269074186': ['pollutionData190073.csv',
  'pollutionData178929.csv',
  'pollutionData178901.csv'],
 '10.187763760747885_56.159418709313904': ['pollutionData182846.csv',
  'pollutionData188092.csv',
  'pollutionData187986.csv'],
 '10.206927436840033_56.105069529457616': ['pollutionData201507.csv',
  'pollutionData204166.csv',
  'pollutionData201535.csv'],
 '10.177203408737114_56.13953206657349': ['pollutionData190259.csv',
  'pollutionData190312.csv',
  'pollutionData179119.csv'],
 '10.17926542270186_56.2049938543326': ['pollutionData192466.csv',
  'pollutionData192438.csv'],
 '10.200700790178303_56.1833360361296': ['pollutionData179202.csv',
  'pollutionData185025.csv',
  'pollutionData184972.csv'],
 '10.218120143516558_56.16631645387974': ['pollutionData178875.csv'],
 '10.148353690807198_56.118198830180894': ['pollutionData201881.csv',
  'pollutionData201908.csv',
  'pollutionData197760.csv'],
 '10.241989084655756_56.20043625463636': ['pollutionData190663.csv'],
 '10.182659856483497_56.15898299999999': ['pollutionData181034.csv',
  'pollutionData188119.csv'],
 '10.11966875826647_56.169454614092764': ['pollutionData195041.csv',
  'pollutionData206396.csv',
  'pollutionData206369.csv'],
 '10.130153804893553_56.17941549701764': ['pollutionData193430.csv',
  'pollutionData195843.csv',
  'pollutionData193402.csv'],
 '10.17948788343233_56.13417989322382': ['pollutionData203716.csv',
  'pollutionData203822.csv',
  'pollutionData203769.csv',
  'pollutionData198330.csv',
  'pollutionData203875.csv'],
 '10.109984271163967_56.16459887184971': ['pollutionData195096.csv',
  'pollutionData195124.csv',
  'pollutionData206343.csv',
  'pollutionData195896.csv'],
 '10.277436490737955_56.21163929866206': ['pollutionData190475.csv',
  'pollutionData192760.csv'],
 '10.192906008598356_56.181353258286634': ['pollutionData185078.csv',
  'pollutionData179228.csv',
  'pollutionData185131.csv'],
 '10.1515794551907_56.167867187555736': ['pollutionData195525.csv',
  'pollutionData186953.csv',
  'pollutionData185396.csv',
  'pollutionData179444.csv'],
 '10.18461071717934_56.178623267668705': ['pollutionData204247.csv',
  'pollutionData179282.csv'],
 '10.267323856483472_56.206985193530365': ['pollutionData190501.csv',
  'pollutionData192813.csv'],
 '10.267205839286817_56.207098572394976': ['pollutionData190529.csv'],
 '10.104986076057457_56.23172069428216': ['pollutionData158386.csv',
  'pollutionData158324.csv'],
 '10.186944694442786_56.1457221852484': ['pollutionData181168.csv'],
 '10.228639215938529_56.19765179702361': ['pollutionData190717.csv',
  'pollutionData192972.csv'],
 '10.157709017196566_56.125829583613914': ['pollutionData201934.csv',
  'pollutionData201828.csv',
  'pollutionData197705.csv'],
 '10.167441665012348_56.12004117576438': ['pollutionData203689.csv',
  'pollutionData198167.csv',
  'pollutionData198113.csv',
  'pollutionData203583.csv',
  'pollutionData198085.csv'],
 '10.195804343585905_56.18461478101305': ['pollutionData181197.csv',
  'pollutionData184998.csv',
  'pollutionData185104.csv'],
 '10.096344851520598_56.18546282170713': ['pollutionData195684.csv',
  'pollutionData193322.csv',
  'pollutionData193294.csv'],
 '10.212459373016372_56.18696229571611': ['pollutionData184945.csv',
  'pollutionData192707.csv',
  'pollutionData184892.csv'],
 '10.246642527612721_56.20913963031665': ['pollutionData192840.csv',
  'pollutionData192546.csv',
  'pollutionData210173.csv'],
 '10.162728804893504_56.10986429894997': ['pollutionData203663.csv',
  'pollutionData197814.csv',
  'pollutionData203636.csv',
  'pollutionData197842.csv'],
 '10.10711200000003_56.21731711429131': ['pollutionData158595.csv',
  'pollutionData158446.csv'],
 '10.246299305557386_56.22521120818609': ['pollutionData209986.csv',
  'pollutionData209933.csv'],
 '10.19893292642405_56.1803125039424': ['pollutionData185051.csv',
  'pollutionData181223.csv',
  'pollutionData185157.csv'],
 '10.161757688325906_56.17312782176926': ['pollutionData185290.csv',
  'pollutionData185343.csv',
  'pollutionData179418.csv',
  'pollutionData195472.csv'],
 '10.269670626983498_56.210806441766366': ['pollutionData190879.csv'],
 '10.145073305557275_56.21399075104399': ['pollutionData172156.csv',
  'pollutionData158624.csv',
  'pollutionData171969.csv',
  'pollutionData158565.csv'],
 '10.143036390212956_56.11906158966682': ['pollutionData201855.csv',
  'pollutionData197679.csv',
  'pollutionData201775.csv'],
 '10.20776318039134_56.136738858609256': ['pollutionData204087.csv',
  'pollutionData204034.csv',
  'pollutionData201291.csv',
  'pollutionData201319.csv'],
 '10.178335597553314_56.162369287665825': ['pollutionData188039.csv',
  'pollutionData182820.csv',
  'pollutionData187933.csv'],
 '10.161157250404358_56.208646307573304': ['pollutionData158744.csv',
  'pollutionData172602.csv'],
 '10.21197608217426_56.161017815103236': ['pollutionData190100.csv',
  'pollutionData190047.csv'],
 '10.192723647815683_56.1417522836526': ['pollutionData206131.csv',
  'pollutionData206184.csv'],
 '10.157454995037142_56.13199024175818': ['pollutionData187483.csv',
  'pollutionData187430.csv'],
 '10.161062711639374_56.169148028055325': ['pollutionData186979.csv',
  'pollutionData182738.csv',
  'pollutionData185369.csv',
  'pollutionData182766.csv'],
 '10.209219127208598_56.17243586196818': ['pollutionData187642.csv',
  'pollutionData180818.csv',
  'pollutionData187589.csv'],
 '10.153436152114864_56.17262995803033': ['pollutionData182712.csv',
  'pollutionData185422.csv',
  'pollutionData185316.csv'],
 '10.201447428241636_56.171122550932225': ['pollutionData187695.csv',
  'pollutionData180844.csv',
  'pollutionData187748.csv'],
 '10.093612498182324_56.16718933444926': ['pollutionData194986.csv'],
 '10.202164315973278_56.11692219631463': ['pollutionData206290.csv',
  'pollutionData201237.csv',
  'pollutionData206263.csv'],
 '10.236217525131224_56.205074': ['pollutionData192893.csv',
  'pollutionData190934.csv',
  'pollutionData192946.csv'],
 '10.233619432540877_56.21728389714838': ['pollutionData190908.csv',
  'pollutionData209854.csv'],
 '10.093516609210042_56.16716656043954': ['pollutionData195870.csv',
  'pollutionData195923.csv'],
 '10.186880262565637_56.14251885276732': ['pollutionData206078.csv',
  'pollutionData190020.csv'],
 '10.166163050262412_56.131053962866226': ['pollutionData187509.csv',
  'pollutionData184621.csv'],
 '10.139025504299298_56.153267352820414': ['pollutionData183009.csv'],
 '10.171526038028787_56.17505006362324': ['pollutionData179364.csv'],
 '10.189355309192706_56.18210217593679': ['pollutionData205997.csv',
  'pollutionData204273.csv'],
 '10.062790576721227_56.100713387988804': ['pollutionData197518.csv'],
 '10.116589665412903_56.22579478256016': ['pollutionData158355.csv',
  'pollutionData171572.csv'],
 '10.140579996364522_56.10097260933967': ['pollutionData198005.csv',
  'pollutionData197977.csv'],
 '10.241876431877131_56.20056009742038': ['pollutionData192919.csv',
  'pollutionData190691.csv'],
 '10.142859364417973_56.11919616177176': ['pollutionData197652.csv'],
 '10.113531440475526_56.182637286706964': ['pollutionData195737.csv',
  'pollutionData195790.csv',
  'pollutionData193348.csv',
  'pollutionData193376.csv'],
 '10.1989185595246_56.14063267124548': ['pollutionData179038.csv',
  'pollutionData204113.csv'],
 '10.087895233135214_56.15286327729632': ['pollutionData195286.csv'],
 '10.218303812914883_56.186546268439095': ['pollutionData193185.csv',
  'pollutionData184919.csv',
  'pollutionData178600.csv'],
 '10.228593618385275_56.19774431284465': ['pollutionData193026.csv',
  'pollutionData190744.csv'],
 '10.201616660049467_56.176038754874654': ['pollutionData187721.csv',
  'pollutionData181305.csv',
  'pollutionData187615.csv'],
 '10.208600965029746_56.14472622987757': ['pollutionData201265.csv',
  'pollutionData206449.csv'],
 '10.139060373016491_56.153135887760996': ['pollutionData183037.csv',
  'pollutionData187032.csv',
  'pollutionData187138.csv'],
 '10.21780255092608_56.18290049276627': ['pollutionData187536.csv',
  'pollutionData178767.csv'],
 '10.185844404928275_56.163969409207326': ['pollutionData187907.csv',
  'pollutionData187960.csv',
  'pollutionData180980.csv'],
 '10.157440224536913_56.154610138216704': ['pollutionData187085.csv',
  'pollutionData183091.csv',
  'pollutionData187191.csv',
  'pollutionData183063.csv'],
 '10.194338714120931_56.16945046812791': ['pollutionData180926.csv',
  'pollutionData187801.csv'],
 '10.207060089618722_56.16816672029917': ['pollutionData187668.csv',
  'pollutionData181331.csv',
  'pollutionData187774.csv'],
 '10.15788067857352_56.125743621869944': ['pollutionData187456.csv',
  'pollutionData184595.csv'],
 '10.154132957008414_56.1404960893661': ['pollutionData187324.csv',
  'pollutionData180709.csv'],
 '10.190940219574031_56.18950967440927': ['pollutionData210093.csv',
  'pollutionData192627.csv'],
 '10.303667644180337_56.25625595964834': ['pollutionData190367.csv'],
 '10.072391914016862_56.15457258895634': ['pollutionData197408.csv',
  'pollutionData197355.csv'],
 '10.087875116567602_56.1529230346212': ['pollutionData197434.csv',
  'pollutionData195259.csv'],
 '10.221273033065813_56.175432085860464': ['pollutionData178793.csv'],
 '10.144907008598352_56.21385651069573': ['pollutionData158655.csv',
  'pollutionData158715.csv'],
 '10.198804084655762_56.10480213435411': ['pollutionData204193.csv',
  'pollutionData204140.csv',
  'pollutionData197922.csv'],
 '10.207113017196662_56.117828971777826': ['pollutionData206237.csv',
  'pollutionData201399.csv',
  'pollutionData201427.csv'],
 '10.171611868717264_56.174917180024806': ['pollutionData195418.csv',
  'pollutionData185237.csv',
  'pollutionData179336.csv'],
 '10.186632644180236_56.13959744418457': ['pollutionData190206.csv',
  'pollutionData190153.csv',
  'pollutionData179093.csv'],
 '10.125013142824173_56.23489759702643': ['pollutionData158536.csv',
  'pollutionData172329.csv',
  'pollutionData158475.csv',
  'pollutionData173225.csv'],
 '10.151387677246134_56.16798814878688': ['pollutionData195578.csv',
  'pollutionData180547.csv'],
 '10.166318618385276_56.13096577062022': ['pollutionData184649.csv',
  'pollutionData203742.csv'],
 '10.198852845403735_56.1407940671622': ['pollutionData206157.csv'],
 '10.139154364418005_56.162574351819416': ['pollutionData195552.csv',
  'pollutionData195605.csv'],
 '10.184485323907893_56.17871060412596': ['pollutionData185184.csv',
  'pollutionData179310.csv',
  'pollutionData195365.csv'],
 '10.143520804893456_56.16018043015113': ['pollutionData180573.csv',
  'pollutionData195631.csv'],
 '10.186756880950952_56.14258759218248': ['pollutionData184729.csv',
  'pollutionData190179.csv',
  'pollutionData190285.csv'],
 '10.175406949737521_56.20417258212644': ['pollutionData158865.csv',
  'pollutionData158954.csv'],
 '10.12084169080731_56.178402535294865': ['pollutionData195817.csv',
  'pollutionData195015.csv',
  'pollutionData195764.csv'],
 '10.189857330024779_56.13458495857738': ['pollutionData198301.csv'],
 '10.07666460978703_56.18959388227456': ['pollutionData193268.csv'],
 '10.17614185152047_56.151949698562795': ['pollutionData189967.csv',
  'pollutionData188251.csv',
  'pollutionData184784.csv'],
 '10.213484466270415_56.17405423428392': ['pollutionData180764.csv',
  'pollutionData187562.csv'],
 '10.209020390213027_56.09926842434083': ['pollutionData204219.csv',
  'pollutionData201589.csv',
  'pollutionData201561.csv'],
 '10.187329678573633_56.12994000000001': ['pollutionData198275.csv',
  'pollutionData204007.csv',
  'pollutionData198247.csv',
  'pollutionData203901.csv'],
 '10.204370307865133_56.141823496238665': ['pollutionData179064.csv'],
 '10.154807944774575_55.988031499663315': ['pollutionData201615.csv'],
 '10.218878251485876_56.19371107014121': ['pollutionData193132.csv',
  'pollutionData184866.csv',
  'pollutionData178548.csv'],
 '10.13978019262504_56.21508593264829': ['pollutionData173011.csv',
  'pollutionData158505.csv',
  'pollutionData158415.csv'],
 '10.125912580356612_56.16254304778694': ['pollutionData206422.csv',
  'pollutionData195150.csv',
  'pollutionData195178.csv'],
 '10.175338207340246_56.179322409643085': ['pollutionData195392.csv',
  'pollutionData193213.csv',
  'pollutionData195339.csv'],
 '10.185914784061424_56.12391430736949': ['pollutionData201211.csv',
  'pollutionData203981.csv',
  'pollutionData203954.csv',
  'pollutionData201183.csv'],
 '10.191119927578029_56.18958131478287': ['pollutionData192600.csv'],
 '10.246154466270468_56.22537224883195': ['pollutionData158684.csv',
  'pollutionData209880.csv'],
 '10.153714822090137_56.1102508220387': ['pollutionData203610.csv',
  'pollutionData198059.csv',
  'pollutionData203530.csv'],
 '10.21908612268453_56.19369241581476': ['pollutionData190770.csv',
  'pollutionData193079.csv'],
 '10.149694601188685_56.148158423711955': ['pollutionData187218.csv',
  'pollutionData180655.csv'],
 '10.18616224669654_56.16389697427008': ['pollutionData180952.csv',
  'pollutionData187854.csv'],
 '10.175128_56.20391': ['pollutionData159014.csv'],
 '10.216211542327983_56.19677547153966': ['pollutionData193053.csv',
  'pollutionData193000.csv'],
 '10.143257948409996_56.1601908856982': ['pollutionData180601.csv',
  'pollutionData187006.csv',
  'pollutionData187059.csv'],
 '10.198778699405693_56.18028339302693': ['pollutionData181251.csv'],
 '10.177235595245293_56.13962771141822': ['pollutionData187350.csv',
  'pollutionData187403.csv'],
 '10.131331836805202_56.152757286457955': ['pollutionData182955.csv',
  'pollutionData182983.csv'],
 '10.153508571758266_56.17267848588397': ['pollutionData194931.csv'],
 '10.261365288360594_56.242032790256985': ['pollutionData190799.csv',
  'pollutionData209960.csv'],
 '10.186762304229774_56.14563850929': ['pollutionData206025.csv',
  'pollutionData189994.csv',
  'pollutionData206502.csv'],
 '10.216251775463206_56.196878435033454': ['pollutionData210120.csv',
  'pollutionData210067.csv',
  'pollutionData210013.csv'],
 '10.174677478504236_56.13241046310714': ['pollutionData198139.csv',
  'pollutionData209801.csv'],
 '10.114700495700845_56.10806431410453': ['pollutionData197544.csv',
  'pollutionData197572.csv',
  'pollutionData201669.csv'],
 '10.211722754631069_56.13236396838821': ['pollutionData201373.csv',
  'pollutionData201345.csv'],
 '10.138403402446784_56.17741297116948': ['pollutionData194878.csv'],
 '10.064734635581999_56.152447520476194': ['pollutionData197381.csv',
  'pollutionData195233.csv'],
 '10.182238219573946_56.19920218884512': ['pollutionData192574.csv'],
 '10.182444749668093_56.19922307868954': ['pollutionData210040.csv',
  'pollutionData159043.csv'],
 '10.122408752149568_56.110590119560015': ['pollutionData197626.csv'],
 '10.149874309192683_56.148242094184255': ['pollutionData180627.csv',
  'pollutionData187165.csv',
  'pollutionData187112.csv'],
 '10.201770887067823_56.17606861552515': ['pollutionData181277.csv'],
 '10.259470361936565_56.20496203409241': ['pollutionData190583.csv',
  'pollutionData192866.csv'],
 '10.209275766864721_56.17235120664372': ['pollutionData180790.csv'],
 '10.148131067458962_56.11814500000001': ['pollutionData201961.csv',
  'pollutionData197788.csv',
  'pollutionData203557.csv'],
 '10.124126151537894_56.0855852379219': ['pollutionData197951.csv'],
 '10.183679466270405_56.14984790483175': ['pollutionData181114.csv',
  'pollutionData189941.csv'],
 '10.259584355819698_56.20482701617347': ['pollutionData190555.csv'],
 '10.293740482139583_56.230013292978384': ['pollutionData190421.csv'],
 '10.157658842922274_56.13203209461566': ['pollutionData187377.csv',
  'pollutionData180735.csv'],
 '10.25068287483407_56.2026461982616': ['pollutionData190637.csv'],
 '10.250786139881143_56.20251117218925': ['pollutionData190609.csv',
  'pollutionData210199.csv'],
 '10.182183959489976_56.17389164456407': ['pollutionData185210.csv',
  'pollutionData184813.csv',
  'pollutionData185263.csv',
  'pollutionData193239.csv'],
 '10.269519082174156_56.2107989833621': ['pollutionData192787.csv',
  'pollutionData192734.csv'],
 '10.161186577298167_56.20869704245814': ['pollutionData158924.csv'],
 '10.221176473541277_56.17540521083046': ['pollutionData178821.csv'],
 '10.192792014715224_56.181459995226994': ['pollutionData179256.csv',
  'pollutionData204300.csv'],
 '10.209599775463175_56.14892750591274': ['pollutionData178955.csv',
  'pollutionData178983.csv',
  'pollutionData190126.csv'],
 '10.293955058860774_56.229971546821645': ['pollutionData190393.csv'],
 '10.182616305557303_56.15498346925998': ['pollutionData181088.csv',
  'pollutionData188225.csv'],
 '10.139116813491796_56.1627072781356': ['pollutionData195204.csv'],
 '10.186652602364234_56.170278565367': ['pollutionData187827.csv',
  'pollutionData187880.csv',
  'pollutionData184839.csv'],
 '10.12228671163939_56.11067162844458': ['pollutionData197598.csv',
  'pollutionData201722.csv'],
 '10.169078780426162_56.20103008023493': ['pollutionData190963.csv'],
 '10.186664830688414_56.139477887997344': ['pollutionData206210.csv'],
 '10.17839594725615_56.162446952950255': ['pollutionData182792.csv'],
 '10.223110775463056_56.190387445286476': ['pollutionData193106.csv',
  'pollutionData192681.csv',
  'pollutionData193159.csv'],
 '10.13969570304107_56.2149789163549': ['pollutionData158895.csv',
  'pollutionData173118.csv'],
 '10.138347076057471_56.17734056158762': ['pollutionData194905.csv'],
 '10.180056017196648_56.12437832738177': ['pollutionData198221.csv',
  'pollutionData203848.csv',
  'pollutionData198193.csv',
  'pollutionData203928.csv'],
 '10.101720288360639_56.18271715899992': ['pollutionData195711.csv',
  'pollutionData195658.csv'],
 '10.083678288360602_56.11996007421442': ['pollutionData197489.csv',
  'pollutionData201643.csv',
  'pollutionData201696.csv'],
 '10.207854230653766_56.114487000000004': ['pollutionData201453.csv',
  'pollutionData206316.csv',
  'pollutionData201481.csv'],
 '10.218124775463139_56.18655111946821': ['pollutionData178713.csv'],
 '10.2121812711639_56.16107681293822': ['pollutionData182683.csv'],
 '10.066129804893535_56.121379546124246': ['pollutionData197463.csv'],
 '10.20872971106246_56.144719132186395': ['pollutionData179009.csv'],
 '10.167189431877205_56.21831017223658': ['pollutionData158776.csv'],